OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f84j11.h
#define _TRISG0                 0x01
#define _RG0                    0x01
#define _TRISG1                 0x02
#define _RG1                    0x02
#define _TRISG2                 0x04
#define _RG2                    0x04
#define _TRISG3                 0x08
#define _RG3                    0x08
#define _TRISG4                 0x10
#define _RG4                    0x10
#define _CCP1OD                 0x20
#define _CCP2OD                 0x40
#define _SPIOD                  0x80

//==============================================================================


//==============================================================================
//        TRISG Bits

extern __at(0x0F98) __sfr TRISG;

typedef union
  {
  struct
    {
    unsigned TRISG0             : 1;
    unsigned TRISG1             : 1;
    unsigned TRISG2             : 1;
    unsigned TRISG3             : 1;
    unsigned TRISG4             : 1;
    unsigned CCP1OD             : 1;
    unsigned CCP2OD             : 1;
    unsigned SPIOD              : 1;
    };

  struct
    {
    unsigned RG0                : 1;
    unsigned RG1                : 1;
    unsigned RG2                : 1;
    unsigned RG3                : 1;
    unsigned RG4                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG                 : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned TRISG              : 5;
    unsigned                    : 3;
    };
  } __TRISGbits_t;

extern __at(0x0F98) volatile __TRISGbits_t TRISGbits;

#define _TRISG_TRISG0           0x01
#define _TRISG_RG0              0x01
#define _TRISG_TRISG1           0x02
#define _TRISG_RG1              0x02
#define _TRISG_TRISG2           0x04
#define _TRISG_RG2              0x04
#define _TRISG_TRISG3           0x08
#define _TRISG_RG3              0x08
#define _TRISG_TRISG4           0x10
#define _TRISG_RG4              0x10
#define _TRISG_CCP1OD           0x20
#define _TRISG_CCP2OD           0x40
#define _TRISG_SPIOD            0x80

//==============================================================================


//==============================================================================
//        DDRH Bits

extern __at(0x0F99) __sfr DDRH;

typedef union
  {
  struct
    {
    unsigned TRISH0             : 1;
    unsigned TRISH1             : 1;
    unsigned TRISH2             : 1;
    unsigned TRISH3             : 1;
    unsigned TRISH4             : 1;
    unsigned TRISH5             : 1;
    unsigned TRISH6             : 1;
    unsigned TRISH7             : 1;
    };

  struct
    {
    unsigned RH0                : 1;
    unsigned RH1                : 1;
    unsigned RH2                : 1;
    unsigned RH3                : 1;
    unsigned RH4                : 1;
    unsigned RH5                : 1;
    unsigned RH6                : 1;
    unsigned RH7                : 1;
    };
  } __DDRHbits_t;

extern __at(0x0F99) volatile __DDRHbits_t DDRHbits;

#define _TRISH0                 0x01
#define _RH0                    0x01
#define _TRISH1                 0x02
#define _RH1                    0x02
#define _TRISH2                 0x04
#define _RH2                    0x04
#define _TRISH3                 0x08
#define _RH3                    0x08
#define _TRISH4                 0x10
#define _RH4                    0x10
#define _TRISH5                 0x20
#define _RH5                    0x20
#define _TRISH6                 0x40
#define _RH6                    0x40
#define _TRISH7                 0x80
#define _RH7                    0x80

//==============================================================================


//==============================================================================
//        TRISH Bits

extern __at(0x0F99) __sfr TRISH;

typedef union
  {
  struct
    {
    unsigned TRISH0             : 1;
    unsigned TRISH1             : 1;
    unsigned TRISH2             : 1;
    unsigned TRISH3             : 1;
    unsigned TRISH4             : 1;
    unsigned TRISH5             : 1;
    unsigned TRISH6             : 1;
    unsigned TRISH7             : 1;
    };

  struct
    {
    unsigned RH0                : 1;
    unsigned RH1                : 1;
    unsigned RH2                : 1;
    unsigned RH3                : 1;
    unsigned RH4                : 1;
    unsigned RH5                : 1;
    unsigned RH6                : 1;
    unsigned RH7                : 1;
    };
  } __TRISHbits_t;

extern __at(0x0F99) volatile __TRISHbits_t TRISHbits;

#define _TRISH_TRISH0           0x01
#define _TRISH_RH0              0x01
#define _TRISH_TRISH1           0x02
#define _TRISH_RH1              0x02
#define _TRISH_TRISH2           0x04
#define _TRISH_RH2              0x04
#define _TRISH_TRISH3           0x08
#define _TRISH_RH3              0x08
#define _TRISH_TRISH4           0x10
#define _TRISH_RH4              0x10
#define _TRISH_TRISH5           0x20
#define _TRISH_RH5              0x20
#define _TRISH_TRISH6           0x40
#define _TRISH_RH6              0x40
#define _TRISH_TRISH7           0x80
#define _TRISH_RH7              0x80

//==============================================================================


//==============================================================================
//        DDRJ Bits

extern __at(0x0F9A) __sfr DDRJ;

typedef union
  {
  struct
    {
    unsigned TRISJ0             : 1;
    unsigned TRISJ1             : 1;
    unsigned TRISJ2             : 1;
    unsigned TRISJ3             : 1;
    unsigned TRISJ4             : 1;
    unsigned TRISJ5             : 1;
    unsigned TRISJ6             : 1;
    unsigned TRISJ7             : 1;
    };

  struct
    {
    unsigned RJ0                : 1;
    unsigned RJ1                : 1;
    unsigned RJ2                : 1;
    unsigned RJ3                : 1;
    unsigned RJ4                : 1;
    unsigned RJ5                : 1;
    unsigned RJ6                : 1;
    unsigned RJ7                : 1;
    };
  } __DDRJbits_t;

extern __at(0x0F9A) volatile __DDRJbits_t DDRJbits;

#define _TRISJ0                 0x01
#define _RJ0                    0x01
#define _TRISJ1                 0x02
#define _RJ1                    0x02
#define _TRISJ2                 0x04
#define _RJ2                    0x04
#define _TRISJ3                 0x08
#define _RJ3                    0x08
#define _TRISJ4                 0x10
#define _RJ4                    0x10
#define _TRISJ5                 0x20
#define _RJ5                    0x20
#define _TRISJ6                 0x40
#define _RJ6                    0x40
#define _TRISJ7                 0x80
#define _RJ7                    0x80

//==============================================================================


//==============================================================================
//        TRISJ Bits

extern __at(0x0F9A) __sfr TRISJ;

typedef union
  {
  struct
    {
    unsigned TRISJ0             : 1;
    unsigned TRISJ1             : 1;
    unsigned TRISJ2             : 1;
    unsigned TRISJ3             : 1;
    unsigned TRISJ4             : 1;
    unsigned TRISJ5             : 1;
    unsigned TRISJ6             : 1;
    unsigned TRISJ7             : 1;
    };

  struct
    {
    unsigned RJ0                : 1;
    unsigned RJ1                : 1;
    unsigned RJ2                : 1;
    unsigned RJ3                : 1;
    unsigned RJ4                : 1;
    unsigned RJ5                : 1;
    unsigned RJ6                : 1;
    unsigned RJ7                : 1;
    };
  } __TRISJbits_t;

extern __at(0x0F9A) volatile __TRISJbits_t TRISJbits;

#define _TRISJ_TRISJ0           0x01
#define _TRISJ_RJ0              0x01
#define _TRISJ_TRISJ1           0x02
#define _TRISJ_RJ1              0x02
#define _TRISJ_TRISJ2           0x04
#define _TRISJ_RJ2              0x04
#define _TRISJ_TRISJ3           0x08
#define _TRISJ_RJ3              0x08
#define _TRISJ_TRISJ4           0x10
#define _TRISJ_RJ4              0x10
#define _TRISJ_TRISJ5           0x20
#define _TRISJ_RJ5              0x20
#define _TRISJ_TRISJ6           0x40
#define _TRISJ_RJ6              0x40
#define _TRISJ_TRISJ7           0x80
#define _TRISJ_RJ7              0x80

//==============================================================================


//==============================================================================
//        OSCTUNE Bits

extern __at(0x0F9B) __sfr OSCTUNE;

typedef union
  {
  struct
    {
    unsigned TUN0               : 1;
    unsigned TUN1               : 1;
    unsigned TUN2               : 1;
    unsigned TUN3               : 1;
    unsigned TUN4               : 1;
    unsigned TUN5               : 1;
    unsigned PLLEN              : 1;
    unsigned INTSRC             : 1;
    };

  struct
    {
    unsigned TUN                : 6;
    unsigned                    : 2;
    };
  } __OSCTUNEbits_t;

extern __at(0x0F9B) volatile __OSCTUNEbits_t OSCTUNEbits;

#define _TUN0                   0x01
#define _TUN1                   0x02
#define _TUN2                   0x04
#define _TUN3                   0x08
#define _TUN4                   0x10
#define _TUN5                   0x20
#define _PLLEN                  0x40
#define _INTSRC                 0x80

//==============================================================================


//==============================================================================
//        MEMCON Bits

